# 1. За день машина проезжает n километров. 
# Сколько дней нужно, чтобы проехать маршрут длиной m километров? 
# При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

# **Input:**

# n = 700

# m = 750

# **Output:**

# 2

# n = int(input('Введите расстояние, пройденное за день: '))
# m = int(input('Введите весь путь: '))

# print((m + n - 1) // n)

# 3. В некоторой школе решили набрать три новых математических класса 
# и оборудовать кабинеты для них новыми партами. За каждой партой может сидеть два учащихся. 
# Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.

# **Input:**

# 20

# 21

# 22

# **Output:**

# 32

# a = int(input('Введите количество учащихся для первого класса: '))
# b = int(input('Введите количество учащихся для второго класса: '))
# c = int(input('Введите количество учащихся для третьего класса: '))

# print((a + 1) //2 + (b + 1) //2 + (c + 1) // 2)

# 5. Вагоны в электричке пронумерованы натуральными числами, начиная с 1 
# (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»; 
# это зависит от того, в какую сторону едет электричка). В каждом вагоне написан его номер. 
# Витя сел в i - й вагон от головы поезда и обнаружил, что его вагон имеет номер j. 
# Он хочет определить, сколько всего вагонов в электричке. 
# Напишите программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать невозможно.

# **Input:**

# 3

# 4

# **Output:**

# 6

# i = int(input('Введите первое число: '))
# j = int(input('Введите второе число: '))

# if i == j:
#     print("Нет возможности узнать количество вагонов")
# else:
#     print(i + j - 1)

# 7. Дано натуральное число. Требуется определить, является ли год с данным номером високосным. 
# Если год является високосным, то выведите YES, иначе выведите NO. 
# Напомним, что в соответствии с григорианским календарем, год является високосным,
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.

# **Input:**

# 2016

# **Output:**

# YES

year = int(input('Введите число: '))

if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print('YES')
else:
    print('NO')