# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# list_1 = [1, 1, 2, 0, -1, 3, 4, 4]
# print(len(set(list_1)))
# set() # преобразование во множества

# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [3, 4, 5, 1, 2]

# list_1 = [1, 2, 3, 4, 5, 6, 7, 9]
# k = 3
# # k %= len(list_1) # Если k длиннее списка
# list_2 = []

# for i in range(k): # Создание шага
#     list_2.append(list_1[len(list_1) - k + i])
# print(list_2)
    
# for i in range(len(list_1) - k):
#     list_2.append(list_1[i])
# print(list_2)

# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# list1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# res_set = set()

# for dict in list1:
#     for key in dict:
#         res_set.add(dict[key].strip())
# print(res_set)    

# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)

list1 = [0, -1, 5, 2, 3]

count = 0

for i in range(1, len(list1)):
    if list1[i - 1] < list1[i]:
        count += 1
print(count) 
